["<PAD>", "<START>", "<END>", "<SEP>", "#", "(", ")", "1", "2", "3", "4", "5", "6", "7", "8", "=", "Acetal", "AcidX-Bromide_Aromatic", "AcidX-Chloride_Aromatic", "AcidX-Chloride_Heteroaromatic", "AcidX-Chloride_SaturatedAliphatic", "AcidX-Chloride_UnsaturatedAliphatic", "AcidX-Fluoride_SaturatedAliphatic", "AcidX-Iodide_SaturatedAliphatic", "AcidX-Triflate_SaturatedAliphatic", "Acid_Aromatic", "Acid_Carbamic", "Acid_Carbonic", "Acid_Heteroaromatic", "Acid_SaturatedAliphatic", "Acid_Thiocarbonic", "Acid_UnsaturatedAliphatic", "Aldehyde_Aromatic", "Aldehyde_Heteroaromatic", "Aldehyde_SaturatedAliphatic", "Aldehyde_UnsaturatedAliphatic", "AliphaticImine", "AliphaticPhosphine", "AliphaticPhosphineOxyde", "AliphaticTertiaryAmine", "AliphaticThioUrea", "AliphaticUrea", "AlkeneNonTerminal", "AlkeneTerminal", "AlkyneNonTerminalAliphatic", "AlkyneNonTerminalAromatic", "AlkyneNonTerminalMix", "AlkyneTerminalAliphatic", "AlkyneTerminalAromatic", "Amide", "Amidine", "Amine_AcyclicSecondary_Aromatic-Aromatic", "Amine_AcyclicSecondary_Aromatic-Heteroaromatic", "Amine_AcyclicSecondary_Heteroaromatic-Heteroaromatic", "Amine_AcyclicSecondary_SaturatedAliphatic-Aromatic", "Amine_AcyclicSecondary_SaturatedAliphatic-Heteroaromatic", "Amine_AcyclicSecondary_SaturatedAliphatic-SaturatedAliphatic", "Amine_AcyclicSecondary_SaturatedAliphatic-UnsaturatedAliphatic", "Amine_AcyclicSecondary_UnsaturatedAliphatic-Aromatic", "Amine_AcyclicSecondary_UnsaturatedAliphatic-Heteroaromatic", "Amine_AcyclicSecondary_UnsaturatedAliphatic-UnsaturatedAliphatic", "Amine_CyclicSecondary_Aromatic-Aromatic", "Amine_CyclicSecondary_Aromatic-Heteroaromatic", "Amine_CyclicSecondary_Heteroaromatic-Heteroaromatic", "Amine_CyclicSecondary_SaturatedAliphatic-Aromatic", "Amine_CyclicSecondary_SaturatedAliphatic-Heteroaromatic", "Amine_CyclicSecondary_SaturatedAliphatic-SaturatedAliphatic", "Amine_CyclicSecondary_SaturatedAliphatic-UnsaturatedAliphatic", "Amine_CyclicSecondary_UnsaturatedAliphatic-Aromatic", "Amine_CyclicSecondary_UnsaturatedAliphatic-Heteroaromatic", "Amine_CyclicSecondary_UnsaturatedAliphatic-UnsaturatedAliphatic", "Amine_Primary_Het5", "Amine_Primary_Het5Het5", "Amine_Primary_Het5Het6", "Amine_Primary_Het5Phe", "Amine_Primary_Het6", "Amine_Primary_Het6Het5", "Amine_Primary_Het6Het6", "Amine_Primary_Het6Phe", "Amine_Primary_Phe", "Amine_Primary_PheHet5", "Amine_Primary_PheHet6", "Amine_Primary_PhePhe", "Amine_Primary_SaturatedAliphatic", "Amine_Primary_UnsaturatedAliphatic", "Anhydride", "AromaticImine", "AromaticPhosphine", "AromaticPhosphineOxyde", "AromaticTertiaryAmine", "AromaticThiourea", "AromaticUrea", "Azide", "Benzylamine_primary", "Boc", "Br", "C", "CF2_Aromatic", "CF2_Heteroaromatic", "CF2_SaturatedAliphatic", "CF2_UnsaturatedAliphatic", "CF3_Aromatic", "CF3_Heteroaromatic", "CF3_SaturatedAliphatic", "CF3_UnsaturatedAliphatic", "Carbamate", "Cl", "Cyanate_Aliphatic", "Cyanate_Aromatic", "Diazo", "EsterAcyclic", "EsterAromatic", "EsterCyclic", "EtherAliphaticAcyclic", "EtherAliphaticCyclic", "EtherAromaticAcyclic", "EtherMixAcyclic", "EtherMixCyclic", "F", "Fmoc", "Guanidine", "HeteroBenzylamine_primary", "Heterocycle5_1NC", "Heterocycle5_1NH", "Heterocycle5_O", "Heterocycle5_S", "Heterocycle5_polyHet", "Heterocycle5_polyHetNH", "Heterocycle6_1N", "Heterocycle6_1NC", "Heterocycle6_polyHet", "Heterocycle6_polyHetNC", "Hydantoin", "HydrazineNonTerminalAliphatic", "HydrazineNonTerminalAromatic", "HydrazineNonTerminalMix", "HydrazineTerminalAliphatic", "HydrazineTerminalAromatic", "HydrazineTerminalCarbamoyl", "HydroxyAmidine", "HydroxylamineAliphatic", "HydroxylamineAromatic", "I", "Imide", "IsoCyanate_Aromatic", "IsoCyanate_SaturatedAliphatic", "Ketals", "KetoneAliphaticAcyclic", "KetoneAliphaticCyclic", "KetoneAromaticAcyclic", "KetoneAromaticCyclic", "KetoneMixAcyclic", "KetoneMixCyclic", "Mesylate", "MixPhosphine", "MixPhosphineOxyde", "MixTertiaryAmine", "MixThiourea", "MixUrea", "N", "Nitrile_Aromatic", "Nitrile_Heteroaromatic", "Nitrile_SaturatedAliphatic", "Nitrile_UnsaturatedAliphatic", "Nitro_Aromatic", "Nitro_Heteroaromatic", "Nitro_SaturatedAliphatic", "Nitro_UnsaturatedAliphatic", "NitrogenBromideAcyclic", "NitrogenBromideCyclic", "NitrogenChlorideAcyclic", "NitrogenChlorideCyclic", "NitrogenFluorideAcyclic", "NitrogenIodideAcyclic", "NitrogenIodideCyclic", "Nitroxy", "O", "Oxime", "P", "PFAS_Aromatic", "PFAS_Heteroaromatic", "PFAS_SaturatedAliphatic", "PFAS_UnsaturatedAliphatic", "Peroxyde", "Phenol", "PhenolHeteroaromatic5membered", "PhenolHeteroaromatic6membered", "PhosphoricAcid", "PhosphoricAmide_Aliphatic", "PhosphoricAmide_Aromatic", "PhosphoricAmide_Mix", "PhosphoricEster_Aromatic", "PhosphoricEster_Heteroaromatic", "PhosphoricEster_SaturatedAliphatic", "PhosphoricEster_UnsaturatedAliphatic", "Pivalic", "PrimaryAlcoholAliphatic", "PrimaryAlcoholAromatic", "PrimaryThiolAliphatic", "PrimaryThiolAromatic", "Pyridone_likeNH", "S", "SecondaryAlcoholAliphaticAcyclic", "SecondaryAlcoholAliphaticCyclic", "SecondaryAlcoholAromaticAcyclic", "SecondaryAlcoholAromaticCyclic", "SecondaryAlcoholMixAcyclic", "SecondaryAlcoholMixCyclic", "SecondaryThiolAliphaticAcyclic", "SecondaryThiolAliphaticCyclic", "SecondaryThiolMixAcyclic", "SecondaryThiolMixCyclic", "SubstitutedHydroxylamineAliphatic", "SubstitutedHydroxylamineAromatic", "Sulfinate", "SulfinylamineAliphatic", "SulfinylamineAromatic", "Sulfone", "Sulfonic_Aliphatic", "Sulfonic_Aromatic", "Sulfonyl-Chloride_Aliphatic", "Sulfonyl-Chloride_Aromatic", "Sulfonyl-Fluoride_Aliphatic", "Sulfonyl-Fluoride_Aromatic", "Sulphonamide0H", "Sulphonamide1H", "Sulphonamide2H", "TertiaryAlcoholAcyclic", "TertiaryAlcoholCyclic", "TertiaryThiolAcyclic", "TertiaryThiolCyclic", "TetraX", "ThioAcetal", "ThioCyanate_Aliphatic", "ThioCyanate_Aromatic", "ThioEsterAcyclic", "ThioEsterCyclic", "ThioKetals", "Thioacid_Carbamic", "Thioacid_Carbonic", "Thioacid_SaturatedAliphatic", "Thiocarbamate", "ThioetherAliphaticAcyclic", "ThioetherAliphaticCyclic", "ThioetherAromaticAcyclic", "ThioetherMixAcyclic", "ThioetherMixCyclic", "ThioisoCyanate_Aromatic", "ThioisoCyanate_Heteroaromatic", "ThioisoCyanate_SaturatedAliphatic", "Thioketone", "Thiophenol", "ThiophenolHeteroaromatic5membered", "ThiophenolHeteroaromatic6membered", "X-Bromide_Aliph", "X-Bromide_Alkyne", "X-Bromide_Het5", "X-Bromide_Het5Het5", "X-Bromide_Het5Het6", "X-Bromide_Het5Phe", "X-Bromide_Het6", "X-Bromide_Het6Het5", "X-Bromide_Het6Het6", "X-Bromide_Het6Phe", "X-Bromide_Phe", "X-Bromide_PheHet5", "X-Bromide_PheHet6", "X-Bromide_PhePhe", "X-Bromide_Vinyl", "X-Chloride_Aliph", "X-Chloride_Alkyne", "X-Chloride_Het5", "X-Chloride_Het5Het5", "X-Chloride_Het5Het6", "X-Chloride_Het5Phe", "X-Chloride_Het6", "X-Chloride_Het6Het5", "X-Chloride_Het6Het6", "X-Chloride_Het6Phe", "X-Chloride_Phe", "X-Chloride_PheHet5", "X-Chloride_PheHet6", "X-Chloride_PhePhe", "X-Chloride_Vinyl", "X-Fluoride_Aliph", "X-Fluoride_Het5", "X-Fluoride_Het5Het5", "X-Fluoride_Het5Het6", "X-Fluoride_Het5Phe", "X-Fluoride_Het6", "X-Fluoride_Het6Het5", "X-Fluoride_Het6Het6", "X-Fluoride_Het6Phe", "X-Fluoride_Phe", "X-Fluoride_PheHet5", "X-Fluoride_PheHet6", "X-Fluoride_PhePhe", "X-Fluoride_Vinyl", "X-Iodide_Aliph", "X-Iodide_Alkyne", "X-Iodide_Het5", "X-Iodide_Het5Het5", "X-Iodide_Het5Het6", "X-Iodide_Het5Phe", "X-Iodide_Het6", "X-Iodide_Het6Het5", "X-Iodide_Het6Het6", "X-Iodide_Het6Phe", "X-Iodide_Nitrile", "X-Iodide_Phe", "X-Iodide_PheHet5", "X-Iodide_PheHet6", "X-Iodide_PhePhe", "X-Iodide_Vinyl", "X-Triflate_Aliph", "X-Triflate_Het5", "X-Triflate_Het6", "X-Triflate_Het6Het5", "X-Triflate_Het6Het6", "X-Triflate_Het6Phe", "X-Triflate_Phe", "X-Triflate_PheHet5", "X-Triflate_PheHet6", "X-Triflate_PhePhe", "X-Triflate_Vinyl", "XFormate", "XKetoneAliphaticBromide", "XKetoneAliphaticChloride", "XKetoneAliphaticFluoride", "XKetoneAliphaticIodide", "XKetoneAliphaticTriflate", "XKetoneAromaticBromide", "XKetoneAromaticChloride", "XKetoneAromaticFluoride", "XKetoneAromaticIodide", "XPhosphorus", "Xformamide", "[C+]", "[C-]", "[CH-]", "[I+]", "[N+]", "[N-]", "[O+]", "[O-]", "[P+]", "[PH]", "[S+]", "[S]"]